# Задача 1:
# Вам дана строка текста. Напишите программу, которая проверяет, содержится ли в ней заданная подстрока.
# Если подстрока найдена, программа должна вывести индекс её первого вхождения в строку,
# иначе - сообщение о том, что подстрока не найдена.

# s = 'Гостиная Анны Павловны начала понемногу наполняться.'
# right_word = 'Анны'
# if right_word in s:
#     otvet = s.find(right_word)
#     print(f'индекс: {otvet}')
# else:
#     print("нет подстроки")


# Задача 2:
# Напишите программу, которая принимает на вход строку и число N.
# Выведите новую строку, состоящую из первых N символов и троеточия "..." в конце.
# Если длина строки меньше или равна N, то новая строка должна быть идентичной исходной.


# line = input(str("Введите строку: "))
# N = int(input("Введите число: "))
# new_line = ''
# N2 = str(N)
# d = len(line)
# c = len(N2)
# if d <= c:
#     new_line = line
#     print(new_line)
# else:
#     new_line = N2 + line + '...'
#     print(new_line)


# Задача 3:
# Напишите программу, которая определяет, является ли заданная строка палиндромом
# (читается одинаково слева направо и справа налево). Программа должна игнорировать пробелы, регистр букв и пунктуацию.

# line = input("Введите строку: ")
# line = line.lower()
# print(line)
# s = (' ', '.', '?,', ',', '-', '!', ':', ';')
# for i in line:
#     if i in s:
#         line = line.replace(i,"")
# print(line)
# if line[::1] == line[::-1]:
#     print(f'Строка: {line}', f'- является палиндромом')
# else:
#     print(f'Строка: {line}', f'- не является палиндромом')


# Задача 4:
# Напишите программу, которая принимает строку и меняет регистр каждой буквы: если буква была в верхнем регистре,
# то она становится строчной, и наоборот.

# line = input("Введите строку: ")
# print(line.swapcase())

# Задача 5:
# Напишите программу, которая переворачивает строку задом наперёд. Например, из строки "Hello" должно получиться "olleH".

# line = input("Введите строку: ")
# line = line[::-1]
# print(line)

# Задача 7:
# Напишите программу, которая принимает строку и выводит на экран частоту встречаемости каждого символа в ней.

# line = input("Введите строку: ")
# line2 = set(line)
# new_line = {}
# for i in line2:
#     key, value = i, line.count(i)
#     new_line [key] = value
# print(new_line)




